# ExternalDefinitionCreationOptions Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
ExternalDefinitionCreationOptions Members
ExternalDefinitionCreationOptions Class Constructors Methods Properties See Also
---
The ExternalDefinitionCreationOptions type exposes the following members.
# Constructors
| Name | Description |
| --- | --- |
| --- | --- | --- |
| ExternalDefinitionCreationOptions(String, ForgeTypeId) | Constructs the options using a specified name and type. |
| ExternalDefinitionCreationOptions(String, ParameterType) | **Obsolete.** Constructs the options using a specified name and type. |

# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the ExternalDefinitionCreationOptions |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDataType | Gets the identifier describing the parameter's data type. The identifier may belong to either a spec or a category. If it is a category, the parameter is a Family Type parameter of that category. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| SetDataType | Sets the parameter's data type. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Description | The description of the parameter definition to be created. The description will be used as tooltip in the Revit UI including in the properties palette. The default is an empty string. |
| GUID | The GUID to use for this parameter definition. If not explicitly set, a random GUID is used. |
| HideWhenNoValue | This property indicates whether this parameter should be hidden from the properties palette when it doesn't have a value. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | The name of the parameter definition to be created. |
| Type | **Obsolete.** The type of the parameter definition to be created. |
| UserModifiable | This property indicates whether this parameter can be modified by UI user or not. |
| Visible | True if the parameter is visible to the user, false if it is hidden and accessible only via the API. The default is true. |

# See Also
ExternalDefinitionCreationOptions Class
Autodesk.Revit.DB Namespace